cases/openfoam.org/combustionChamber/0.org/S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletCenter
    {
        type            fixedValue;
        value           uniform 1;
    }
    inletLeftRight
    {
        type            fixedValue;
        value           uniform 0.5;
    }
    inletMid
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    wallCenterInner
    {
        type            zeroGradient;
    }
    wallCenterOuter
    {
        type            zeroGradient;
    }
    wallDiffusor
    {
        type            zeroGradient;
    }
    wallInletSmall
    {
        type            zeroGradient;
    }
    wallSphere
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
