cases/openfoam.org/combustionChamber/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletCenter
    {
        type            fixedValue;
        value           uniform (0 0 -0.34);
    }
    inletLeftRight
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 0.008;
        extrapolateProfile false;
        value           uniform (0 0 0);
    }
    inletMid
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 0.004;
        extrapolateProfile false;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    wallCenterInner
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wallCenterOuter
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wallDiffusor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wallInletSmall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wallSphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
