cases/openfoam.org/combustionChamber/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    inletCenter
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.12*0.07;
        value           $internalField;
    }
    inletLeftRight
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.06*0.07;
        value           $internalField;
    }
    inletMid
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.06*0.07;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           $internalField;
    }
    wallCenterInner
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    wallCenterOuter
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    wallDiffusor
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    wallInletSmall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    wallSphere
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
