cases/openfoam.org/combustionChamber/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inletCenter
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.005;
        value           $internalField;
    }
    inletLeftRight
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;
        value           $internalField;
    }
    inletMid
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           $internalField;
    }
    wallCenterInner
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wallCenterOuter
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wallDiffusor
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wallInletSmall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wallSphere
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
