cases/openfoam.org/combustionChamber/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    pFinal
    {
        $p;
        relTol 0;
    }

    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    UFinal
    {
        $U;
        relTol 0;
    }

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    kFinal
    {
        $k;
        relTol 0;
    }

    epsilon 
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    epsilonFinal
    {
        $epsilon;
        relTol 0;
    }

    S 
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    S 
    {
        $epsilon;
        relTol 0;
    }
}


PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    6;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    turbOnFinalIterOnly true;

    residualControl
    {
        p
        {
            relTol 0;
            tolerance 1e-4;
        }

        U
        {
            relTol 0;
            tolerance 1e-5;
        }
    }
}


relaxationFactors
{
    fields
    {
        p               0.4;
        pFinal          1;
    }
    equations
    {
        U               0.6;
        k               0.6;
        epsilon         0.6;

        UFinal          1;
        kFinal          1;
        epsilonFinal    1;
    }
}


// ************************************************************************* //
